In [17]:
#Question 1

a = 0
def b():
 global a
 a = c(a)
def c(a):
 return a + 2

In [18]:
>>> b()

In [19]:
>>> b()

In [20]:
>>> b()

In [21]:
# When global a=0, the function c(a) which is to return a+2 will then be 0+2=2. 
#For each b(), there will be additional 2 added to the output which then give us the final output as 6

6

#Question 2

In [20]:
def file_length(file_name):
    file = open('midterm.py')
    contents = file.read()
    file.close()
    print(len(contents))

#Question 4

In [81]:
from tkinter import Tk, Label, RAISED
root = Tk()
labels = [['MC', 'M+', 'M-', 'MR'],
['C' , '\u221a', 'x\u00b2', '+' ],
['7' , '8' , '9' , '-' ],
['4' , '5' , '6' , '*' ],
['1' , '2' , '3' , '/' ],
['0' , '.' , '+-', '=' ]]

for r in range(6):
    for c in range(4):
        label = Label(root,
            relief=RAISED,
            padx=10,
            text=labels[r] [c])
        label.grid(row=r, column =c)
root.mainloop()

In [90]:
from tkinter import *

root = Tk()

a = Label(root, text= 'Loan Amount:')
a.grid(row = 1)
b = Entry(root)
b.grid (row=1, column = 1)


d = Label(root, text= 'Interest rate:')
d.grid(row = 2)
q = Entry(root)
q.grid (row=2, column = 1)


f = Label(root, text= 'Loan terms:')
f.grid(row = 3)
k = Entry(root)
k.grid (row=3, column = 1)


g = Label(root, text= 'Compute mortgage:')
g.grid(row = 4)
o = Entry(root)
o.grid (row=4, column = 1)

root.mainloop()

#Question 5

In [18]:
#Defining function collatz. 

def Collatz(x): 
    
    
    while x != 1: 
        print(x, end = ' ') 
  
        if x & 1: 
            x = 3 * x + 1
         
        else: 
            x = x // 2
  
    print(x)

In [16]:
Collatz(1)

1

In [19]:
Collatz(10)

10 5 16 8 4 2 1

#Question 6

In [1]:
def binary (n):
    if n < 2:
        return [n]
    else:
        return binary (n // 2) + [n % 2]

binary(0)

[0]

In [2]:
binary(1)

[1]

In [3]:
binary(3)

[1, 1]

In [4]:
binary(9)

[1, 0, 0, 1]

#Question 9
Kindly note that I've used another method as the book method kept giving me error

In [44]:
%load_ext sql

In [45]:
%sql sqlite://

'Connected: @None'

In [48]:
%%sql
CREATE TABLE May8weather(City, Country, Season, Temperature, Rainfall);
INSERT INTO May8weather VALUES('Mumbai','India','Winter','24.8','5.9');
INSERT INTO May8weather VALUES('Mumbai', 'India', 'Spring', '28.4', '16.2');
INSERT INTO May8weather VALUES('Mumbai', 'India', 'Summer', '27.9', '1549.4');
INSERT INTO May8weather VALUES('Mumbai', 'India', 'Fall', '27.6', '346.0');
INSERT INTO May8weather VALUES('London', 'United Kingdom', 'Winter', '4.2', '207.7');
INSERT INTO May8weather VALUES('London', 'United Kingdom', 'Spring', '8.3', '169.6');
INSERT INTO May8weather VALUES('London', 'United Kingdom', 'Summer', '15.7', '157.0');
INSERT INTO May8weather VALUES('London', 'United Kingdom', 'Fall', '10.4', '218.5');
INSERT INTO May8weather VALUES('Cairo', 'Egypt', 'Winter', '13.6', '16.5');
INSERT INTO May8weather VALUES('Cairo', 'Egypt', 'Spring', '20.7', '6.5');
INSERT INTO May8weather VALUES('Cairo', 'Egypt', 'Summer', '27.7', '0.1');
INSERT INTO May8weather VALUES('Cairo', 'Egypt', 'Fall', '22.2', '4.5');

 * sqlite://
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [50]:
%sql SELECT * FROM MAY8WEATHER;

 * sqlite://
Done.

[('Mumbai', 'India', 'Winter', '24.8', '5.9'),
 ('Mumbai', 'India', 'Spring', '28.4', '16.2'),
 ('Mumbai', 'India', 'Summer', '27.9', '1549.4'),
 ('Mumbai', 'India', 'Fall', '27.6', '346.0'),
 ('London', 'United Kingdom', 'Winter', '4.2', '207.7'),
 ('London', 'United Kingdom', 'Spring', '8.3', '169.6'),
 ('London', 'United Kingdom', 'Summer', '15.7', '157.0'),
 ('London', 'United Kingdom', 'Fall', '10.4', '218.5'),
 ('Cairo', 'Egypt', 'Winter', '13.6', '16.5'),
 ('Cairo', 'Egypt', 'Spring', '20.7', '6.5'),
 ('Cairo', 'Egypt', 'Summer', '27.7', '0.1'),
 ('Cairo', 'Egypt', 'Fall', '22.2', '4.5')]

In [53]:
#9a
%sql SELECT Temperature FROM MAY8WEATHER;

 * sqlite://
Done.

[('24.8',),
 ('28.4',),
 ('27.9',),
 ('27.6',),
 ('4.2',),
 ('8.3',),
 ('15.7',),
 ('10.4',),
 ('13.6',),
 ('20.7',),
 ('27.7',),
 ('22.2',)]

In [56]:
#9b
%sql SELECT DISTINCT City FROM MAY8WEATHER;

 * sqlite://
Done.

[('Mumbai',), ('London',), ('Cairo',)]

In [65]:
#9c
%sql SELECT * FROM MAY8WEATHER WHERE Country = 'India';

 * sqlite://
Done.

[('Mumbai', 'India', 'Winter', '24.8', '5.9'),
 ('Mumbai', 'India', 'Spring', '28.4', '16.2'),
 ('Mumbai', 'India', 'Summer', '27.9', '1549.4'),
 ('Mumbai', 'India', 'Fall', '27.6', '346.0')]

In [66]:
#9d
%sql SELECT * FROM MAY8WEATHER WHERE Season = 'Fall';

 * sqlite://
Done.

[('Mumbai', 'India', 'Fall', '27.6', '346.0'),
 ('London', 'United Kingdom', 'Fall', '10.4', '218.5'),
 ('Cairo', 'Egypt', 'Fall', '22.2', '4.5')]

In [71]:
#9e
%sql SELECT City, Country, Season FROM MAY8WEATHER WHERE Rainfall BETWEEN "200" AND "400"

 * sqlite://
Done.

[('Mumbai', 'India', 'Fall'),
 ('London', 'United Kingdom', 'Winter'),
 ('London', 'United Kingdom', 'Fall'),
 ('Cairo', 'Egypt', 'Fall')]

In [72]:
#9f
%sql SELECT City, Country FROM MAY8WEATHER WHERE Season ="Fall" AND Temperature >= "20" ORDER BY Temperature

 * sqlite://
Done.

[('Cairo', 'Egypt'), ('Mumbai', 'India')]

In [75]:
#9g
%sql SELECT SUM(Rainfall),City FROM MAY8WEATHER WHERE City ="Cairo"

 * sqlite://
Done.

[(27.6, 'Cairo')]

In [76]:
#9h
%sql SELECT SUM(Rainfall),Season FROM MAY8WEATHER GROUP BY Season

 * sqlite://
Done.

[(569.0, 'Fall'),
 (192.29999999999998, 'Spring'),
 (1706.5, 'Summer'),
 (230.1, 'Winter')]

In [ ]:
#Question 10

In [39]:
#10a

word = ['The', 'quick', 'brown', 'fox', 'jumps', 'over','the', 'lazy', 'dog']

sentence=[]

for t in word:
    sentence.append(t.upper())

print(sentence)

['THE', 'QUICK', 'BROWN', 'FOX', 'JUMPS', 'OVER', 'THE', 'LAZY', 'DOG']

In [40]:
#10b

word = ['The', 'quick', 'brown', 'fox', 'jumps', 'over','the', 'lazy', 'dog']

sentence=[]

for t in word:
    sentence.append(t.lower())

print(sentence)

['the', 'quick', 'brown', 'fox', 'jumps', 'over', 'the', 'lazy', 'dog']

In [41]:
 #10c
['The', 'quick', 'brown', 'fox', 'jumps', 'over','the', 'lazy', 'dog']

sentence=[]

for t in word:
    sentence.append(len(t))

print(sentence)

[3, 5, 5, 3, 5, 4, 3, 4, 3]

In [22]:
#10d
word = ['The', 'quick', 'brown', 'fox', 'jumps', 'over','the', 'lazy', 'dog']

sentence1=[]
sentence2=[]
sentence3=[]

for t in word:
    sentence1.append(t.upper())

for t in word:
    sentence2.append(t.lower())

for t in word:
    sentence3.append(len(t))

list(map(list, zip(sentence1,sentence2,sentence3)))

[['THE', 'the', 3],
 ['QUICK', 'quick', 5],
 ['BROWN', 'brown', 5],
 ['FOX', 'fox', 3],
 ['JUMPS', 'jumps', 5],
 ['OVER', 'over', 4],
 ['THE', 'the', 3],
 ['LAZY', 'lazy', 4],
 ['DOG', 'dog', 3]]

In [44]:
#10e

word = ['The', 'quick', 'brown', 'fox', 'jumps', 'over','the', 'lazy', 'dog']

sentence4=[]

for t in word:
    if len(t)>=4:   
       sentence4.append(t)
print(sentence4)

['quick', 'brown', 'jumps', 'over', 'lazy']